In [37]:
import pandas as pd

# Example DataFrame
df = pd.DataFrame(
    {
        "Name": ["Alice", None, "Bob", None, "Eve"],
        "City": [None, "Paris", "New York", None, "London"],
    }
)
df

    Name      City
0  Alice      None
1   None     Paris
2    Bob  New York
3   None      None
4    Eve    London

#### Fill missing values with a default string

In [38]:
# df["Name"] = df["Name"].fillna("None")
# df["City"] = df["City"].fillna("None")

print(df)

    Name      City
0  Alice      None
1   None     Paris
2    Bob  New York
3   None      None
4    Eve    London

#### Filling with the Mode (Most Frequent Value):

In [39]:
df["Name"] = df["Name"].fillna(df["Name"].mode()[0])
df["City"] = df["City"].fillna(df["City"].mode()[0])

print(df)

#### Filling with Forward Fill (propagate the last valid value)

In [40]:
df['Name'] = df['Name'].ffill()
df['City'] = df['City'].ffill()

print(df)

#### Backward fill missing values

In [41]:
df['Name'] = df['Name'].bfill()
df['City'] = df['City'].bfill()
df

    Name      City
0  Alice     Paris
1    Bob     Paris
2    Bob  New York
3    Eve    London
4    Eve    London

In [42]:
# Drop rows with any missing values

In [43]:
df.dropna(subset=['Name', 'City'], inplace=True)

print(df)

    Name      City
0  Alice     Paris
1    Bob     Paris
2    Bob  New York
3    Eve    London
4    Eve    London